package ex01_백정이;

public class Problem {

}
//실습문제
//1. Person 클래스를 상속하는 Student 클래스를 작성하기 
//Person 클래스의 필수 멤버(필요한 것은 추가하여 작성)
//   필드 : 이름, 나이(접근제한자 private)
//   생성자 : 매개변수 모두 받는 생성자(접근제한자 public)
//   점수계산메소드(접근제한자 public, 메소드명 score) => 점수가 없습니다 출력
//   
//Student클래스
//   필드 : 점수(접근제한자 private)
//   생성자 : 매개변수 모두 받는 생성자(접근제한자 public)
//   점수계산메소드 오버라이딩 => 학생이름의 점수는 몇점입니다 출력
//
//[ 조건 ] Person클래스 Student클래스의 상속구조를 추상클래스나 인터페이스 구조로 확장하기
//
//2. 은행 계좌 프로그램
//은행계좌 클래스 : Account
//필드 : 잔고 balance
//출금 메소드 : withdraw 매개변수1개 => 잔액보다 출금 금액이 크다면 출금불가 예외 처리 / 현재 잔고는 0원입니다. 
//            출금금액의 0원이 부족하여 출금이 불가합니다. 출력
//입금 메소드 : deposit 매개변수1개 => 잔액에 입급된 금액 추가 후 입금된 금액은 0원입니다. 현재 잔고는 0원입니다 출력
//
//=> 모든 예외처리는 메소드를 사용하는 쪽으로 던지기
//
//3. 문자열의 쉼표를 느낌표로 바꿔서 출력하는 프로그램(람다식 활용, 익명클래스 먼저 작성)
//인터페이스 : StringInter
//메소드   : String modify(String str);    매개변수 o , 리턴값 o      
//
//메인 클래스 : Main
//메소드 : main메소드
//   String nation = "Korea,Spain,Germany,America";