package ex03_백정이;

public class Ex03 {

//	문제 3. 정수 배열에서 최대값과 최소값을 출력하는 메소드를 작성하려고한다. (20점)
//	
//	코드 작성없이 한글로 로직구성만 하되, 메소드 정의 방법에 따라 순서 맞춰 작성하세요.
	
	//로직구성 
	//리턴타입 => void 
	//메소드명 => getMinMax
	//매개변수 => 정수형 배열 1개 
	//실행할 문장 => 
	//정수형 변수 2개 선언(최대값, 최소값), 각각 배열의 첫번째 값으로 초기화
	//for문 사용 => 초기식 int i = 1; 조건식 i < 배열의길이; 증감식 i++
	//	삼항연산자 사용 => 최대값변수보다 배열[i]가 크다가 true이면 배열[i] 값을, false이면 최대값변수 값을 최대값변수에 대입 
	//	삼항연산자 사용 => 최소값변수보다 배열[i]가 작다가 true이면 배열[i] 값을, false이면 최소값변수 값을 최소값변수에 대입 
	//출력(최대값 : 최대값변수, 최소값 : 최소값변수)
}


